app/controllers/users_controller.rb

  def create
    @user = User.find_by_email(params[:user][:email])

    if @user.nil?

      @user = User.new(user_params)

      @referred_by = User.find_by_referral_code(cookies[:h_ref])

      if !@referred_by.nil?
        @user.referrer = @referred_by
      end

      @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "charles.d.michaels@gmail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."referral_code" = $1 LIMIT 1  [["referral_code", "02be9e703c"]]
INSERT INTO "users" ("email", "created_at", "updated_at", "referral_code") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "charles.d.michaels@gmail.com"], ["created_at", "2015-03-27 20:37:09.886317"], ["updated_at", "2015-03-27 20:37:09.886317"], ["referral_code", "02be9e703c"]]

  def refer
  	email = cookies[:h_email]
  	@user = User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "rogerximenez@gmail.com"]]